{
  "_name_or_path": "distilbert-base-uncased",
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "INTJ",
    "1": "INTP",
    "2": "ENTJ",
    "3": "ENTP",
    "4": "INFJ",
    "5": "INFP",
    "6": "ENFJ",
    "7": "ENFP",
    "8": "ISTJ",
    "9": "ISFJ",
    "10": "ESTJ",
    "11": "ESFJ",
    "12": "ISTP",
    "13": "ISFP",
    "14": "ESTP",
    "15": "ESFP"
  },
  "initializer_range": 0.02,
  "label2id": {
    "ENFJ": 6,
    "ENFP": 7,
    "ENTJ": 2,
    "ENTP": 3,
    "ESFJ": 11,
    "ESFP": 15,
    "ESTJ": 10,
    "ESTP": 14,
    "INFJ": 4,
    "INFP": 5,
    "INTJ": 0,
    "INTP": 1,
    "ISFJ": 9,
    "ISFP": 13,
    "ISTJ": 8,
    "ISTP": 12
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.29.2",
  "vocab_size": 30522
}
